tutorials/tested/baseCaseMass/0.org/N2Mass
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     1.0;
    format      ascii;
    class       volScalarField;
    object      N2;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform wN2Set;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform wN2Set;
    }
    outlet
    {
        type            zeroGradient;
    }
    sides
    {
        type            zeroGradient;
    }
    sphere
    {
        type            fixedValue;
        value           uniform 0.1;
    }
        sphere_slave
    {
        type            fixedValue;
        value           uniform 0.1;
    }
    
}

// ************************************************************************* //
